/****************************************************************************/
/*                                                                          */
/*              广州创龙电子科技有限公司                                    */
/*                                                                          */
/*              Copyright (C) 2016 Tronlong Electronic Technology Co.,Ltd   */
/*                                                                          */
/****************************************************************************/
/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      程序编写：斌                                                        *
 *      最后修改时间：2014年03月20日                                        *
 *                  													    *
 * ------------------------------------------------------------------------ */

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      库、宏定义及全局变量                                                *
 *                                                                          *
 * ------------------------------------------------------------------------ */
#include <c6x.h>
#include "main.h"

char Flag = 0;

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      延时函数                                                            *
 *                                                                          *
 * ------------------------------------------------------------------------ */
// 延时（非精确）
void Delay(unsigned int n)
{
	unsigned int i;

	for(i = n; i > 0; i--);
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      中断初始化                                                          *
 *                                                                          *
 * ------------------------------------------------------------------------ */
void InterruptInit(void)
{
	// 禁用全局中断
	CSR &= 0xFFFE;

    // 中断向量表
    ISTP = 0x11800000;

	// 映射中断
    *(volatile unsigned int *)0x0180010C = 0x41;

	// 清除可屏蔽中断状态
	ICR = 0xFFF0;

	// 中断设置
	ISR = 0x0000;

	// 中断使能
	IER = 0xFFFF;

	// 使能全局中断
	CSR |= 0x0001;
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      GPIO 功能复用设置                                                   *
 *                                                                          *
 * ------------------------------------------------------------------------ */
void GPIOBankPinMuxSet(void)
{
	// 底板 LED 复用为普通 I/O 口
	SYSCFG0Regs.PINMUX1.bit.PINMUX1_31_28 = 8;
	SYSCFG0Regs.PINMUX1.bit.PINMUX1_27_24 = 8;
	SYSCFG0Regs.PINMUX1.bit.PINMUX1_23_20 = 8;
	SYSCFG0Regs.PINMUX1.bit.PINMUX1_11_8  = 8;

	// GPIO0[6] 复用为普通 I/O 口
	SYSCFG0Regs.PINMUX1.bit.PINMUX1_7_4 = 8;
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      GPIO 管脚初始化                                                     *
 *                                                                          *
 * ------------------------------------------------------------------------ */
void GPIOBankPinInit(void)
{
	// GPIO0[6] 配置为输入口
    GPIORegs.DIR01.bit.GP0P6 = 1;

	// 底板 LED 配置为输出口
	GPIORegs.DIR01.bit.GP0P0 = 0;
	GPIORegs.DIR01.bit.GP0P1 = 0;
	GPIORegs.DIR01.bit.GP0P2 = 0;
	GPIORegs.DIR01.bit.GP0P5 = 0;
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      GPIO 管脚中断初始化                                                 *
 *                                                                          *
 * ------------------------------------------------------------------------ */
void GPIOBankPinInterruptInit(void)
{
	// GPIO0[6] 配置为下降沿触发
	GPIORegs.CLR_RIS_TRIG01.bit.GP0P6 = 0;
	GPIORegs.SET_FAL_TRIG01.bit.GP0P6 = 1;

	// 使能 GPIO BANK 中断
	GPIORegs.BINTEN.bit.EN0 = 1;
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      系统初始化                                                          *
 *                                                                          *
 * ------------------------------------------------------------------------ */
void SystemInit(void)
{
    // 设置 GPIO 管脚复用
    GPIOBankPinMuxSet();

    // 中断初始化
    InterruptInit();

    // GPIO 管脚初始化
    GPIOBankPinInit();

    // GPIO 管脚中断初始化
    GPIOBankPinInterruptInit();
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      GPIO 中断服务函数                                                   *
 *                                                                          *
 * ------------------------------------------------------------------------ */
interrupt void USER0KEYIsr(void)
{
	// 清除可屏蔽中断状态
	ICR = 0xFFF0;

	// 清除外设中断状态
	GPIORegs.INTSTAT01.bit.GP0P6 = 1;

	// 取反标志位
    Flag = ~Flag;
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *      主函数                                                              *
 *                                                                          *
 * ------------------------------------------------------------------------ */
void main(void)
{
	// 初始化
	SystemInit();

	for(;;)
	{
		while(Flag)
		{
			GPIORegs.OUT_DATA01.all = 0;
			GPIORegs.OUT_DATA01.bit.GP0P0 = 1;
			Delay(0x00FFFFFF);

			GPIORegs.OUT_DATA01.all = 0;
			GPIORegs.OUT_DATA01.bit.GP0P5 = 1;
			Delay(0x00FFFFFF);

			GPIORegs.OUT_DATA01.all = 0;
			GPIORegs.OUT_DATA01.bit.GP0P1 = 1;
			Delay(0x00FFFFFF);

			GPIORegs.OUT_DATA01.all = 0;
			GPIORegs.OUT_DATA01.bit.GP0P2 = 1;
			Delay(0x00FFFFFF);
		}
	}
}
